#!/usr/bin/env bash

# в условиях задачи не было проверки параметров, но нам нет смысла что-то дальше делать, если урла нет
if [ -z "$1" ]; then
  echo "url is not specified"
  exit
fi

URL="$1"

# дергаем апи, глушим весь вывод в консоль, оставляем только статус в переменной
HTTP_CODE=$(curl -s -o /dev/null -w "%{http_code}" "$URL")

# согласно условий задачи только 200 считаем успешным. На деле я бы проверял >=200 и <300
if [ $HTTP_CODE = 200 ]; then
  echo "API доступен"
  exit 0
else
  echo "API недоступен код ответа: $HTTP_CODE"
  exit 1
fi
